                                                ### DMVPN (Dynamic Multiple VPN)

-하나의 Interface를 사용하여 다수의 사설망 연결이 가능한 VPN
  (EX = 하나의 본사와 다수의 지사를 하나의 Interface를 사용하여 연결)


-R1 = ISP-1
-R2 = ISP-2
-R3 = ISP-3

-R4 = Seoul-HQ
-R5 = Gwangju
-R6 = Busan

-DMVPN을 구성하기위한 공중망 설정
 .OSPF Process = 100 , Area = 123 , Router-ID = 13.13.X.X  (X = Router 번호)
 .OSPF 라우팅 업데이트가 필요한 Interface로만 OSPF Packet이 송신되어야 한다.
 .ISP-1 , ISP-2 , ISP-3의 Loopback 0 네트워크는 OSPF에 포함되어야 한다.
 .OSPF환경내의모든 네트워크는 Interface상의 SubnetMask로 확인되어야 한다.

    # ISP-1
router ospf 100
 router-id 13.13.1.1
 network 13.13.1.0  0.0.0.255 area 123
 network 13.13.12.0  0.0.0.255 area 123
 network 13.13.13.0  0.0.0.255 area 123
 passive-interface default
 no passive-interface serial 1/0.12
 no passive-interface serial 1/0.13
!
interface loopback 0
 ip ospf network point-to-point
!

    # ISP-2
router ospf 100
 router-id 13.13.2.2
 network 13.13.2.0  0.0.0.255 area 123
 network 13.13.12.0  0.0.0.255 area 123
 network 13.13.23.0  0.0.0.255 area 123
 passive-interface default
 no passive-interface serial 1/0.12
 no passive-interface serial 1/0.23
!
interface loopback 0
 ip ospf network point-to-point
!

    # ISP-3
router ospf 100
 router-id 13.13.3.3
 network 13.13.3.0  0.0.0.255 area 123
 network 13.13.13.0  0.0.0.255 area 123
 network 13.13.23.0  0.0.0.255 area 123
 passive-interface default
 no passive-interface serial 1/0.13
 no passive-interface serial 1/0.23
!
interface loopback 0
 ip ospf network point-to-point
!


        정보 확인

ISP-1# show ip ospf neighbor
Neighbor ID     Pri   State           	Dead Time   Address         Interface
13.13.3.3          0   FULL/  -        	00:00:36    13.13.13.3      Serial1/0.13
13.13.2.2          0   FULL/  -        	00:00:36    13.13.12.2      Serial1/0.12


ISP-2# show ip ospf neighbor
Neighbor ID     Pri   State           	Dead Time   Address         Interface
13.13.3.3          0   FULL/  -        	00:00:35    13.13.23.3      Serial1/0.23
13.13.1.1          0   FULL/  -        	00:00:34    13.13.12.1      Serial1/0.12


ISP-3# show ip ospf neighbor
Neighbor ID     Pri   State           	Dead Time   Address         Interface
13.13.2.2          0   FULL/  -        	00:00:37    13.13.23.2      Serial1/0.23
13.13.1.1          0   FULL/  -        	00:00:35    13.13.13.1      Serial1/0.13


ISP-1# show ip route
C    211.241.14.0/24 is directly connected, FastEthernet0/0
     13.0.0.0/24 is subnetted, 7 subnets
C       13.13.1.0 is directly connected, Loopback0		<--- ISP-1 Loopback 네트워크
O       13.13.2.0 [110/65] via 13.13.12.2, 00:00:57, Serial1/0.12	<--- ISP-2 Loopback 네트워크
O       13.13.3.0 [110/65] via 13.13.13.3, 00:00:57, Serial1/0.13	<--- ISP-3 Loopback 네트워크
C       13.13.10.0 is directly connected, FastEthernet0/1
C       13.13.12.0 is directly connected, Serial1/0.12
C       13.13.13.0 is directly connected, Serial1/0.13
O       13.13.23.0 [110/128] via 13.13.13.3, 00:00:57, Serial1/0.13
                        [110/128] via 13.13.12.2, 00:00:57, Serial1/0.12


ISP-2# show ip route
C    211.241.25.0/24 is directly connected, FastEthernet0/0
     13.0.0.0/24 is subnetted, 7 subnets
O       13.13.1.0 [110/65] via 13.13.12.1, 00:02:16, Serial1/0.12	<--- ISP-1 Loopback 네트워크
C       13.13.2.0 is directly connected, Loopback0		<--- ISP-2 Loopback 네트워크
O       13.13.3.0 [110/65] via 13.13.23.3, 00:02:16, Serial1/0.23	<--- ISP-3 Loopback 네트워크
C       13.13.12.0 is directly connected, Serial1/0.12
O       13.13.13.0 [110/128] via 13.13.23.3, 00:02:16, Serial1/0.23
                        [110/128] via 13.13.12.1, 00:02:16, Serial1/0.12
C       13.13.20.0 is directly connected, FastEthernet0/1
C       13.13.23.0 is directly connected, Serial1/0.23


ISP-3# show ip route
C    211.241.36.0/24 is directly connected, FastEthernet0/0
     13.0.0.0/24 is subnetted, 7 subnets
O       13.13.1.0 [110/65] via 13.13.13.1, 00:02:34, Serial1/0.13	<--- ISP-1 Loopback 네트워크
O       13.13.2.0 [110/65] via 13.13.23.2, 00:02:34, Serial1/0.23	<--- ISP-2 Loopback 네트워크
C       13.13.3.0 is directly connected, Loopback0		<--- ISP-3 Loopback 네트워크
O       13.13.12.0 [110/128] via 13.13.23.2, 00:02:34, Serial1/0.23
                        [110/128] via 13.13.13.1, 00:02:34, Serial1/0.13
C       13.13.13.0 is directly connected, Serial1/0.13
C       13.13.23.0 is directly connected, Serial1/0.23
C       13.13.30.0 is directly connected, FastEthernet0/1





=============================================================================================================================


                     ### EIGRP를 사용한 사설망 연결

-AS = 456 , 자동 요약 기능은 사용하지 않는다.
 .EIGRP 라우팅 업데이트가 필요한 Interface로만 EIGRP Packet이 송신되어야 한다.
 .ISP-1 , ISP-2 , ISP-3의 FastEthernet 0/1 네트워크는 EIGRP에 포함되어야 한다.
  [ISP FastEthernet 0/1 = 13.13.x0.0/24]


            ## ISP-1  <--->  Seoul-HQ 구간 사설망 연결

   # ISP-1
router eigrp 100
 no auto-summary
 network 13.13.10.0  0.0.0.255
 network 211.241.14.0
 passive-interface default
 no passive-interface fastethernet 0/0
!


   # Seoul-HQ (R4)
router eigrp 100
 no auto-summary
 network 13.13.4.0  0.0.0.255
 network 192.168.4.0
 network 211.241.14.0
 passive-interface default
 no passive-interface fastethernet 0/0
!

          정보 확인

ISP-1# show ip eigrp neighbor
IP-EIGRP neighbors for process 100
H   Address                 	Interface       Hold  Uptime   SRTT   RTO  Q   Seq
                                                        (sec)               (ms)          Cnt Num
0   211.241.14.4            	Fa0/0              12  00:00:05   58    348   0   3


ISP-1# show ip route eigrp
D    192.168.4.0/24 [90/307200] via 211.241.14.4, 00:00:30, FastEthernet0/0        <---- 서울 본사 경로 확인
      13.0.0.0/24 is subnetted, 8 subnets
D       13.13.4.0 [90/409600] via 211.241.14.4, 00:00:30, FastEthernet0/0

ISP-1# ping 192.168.4.4








            ## ISP-2  <--->  Gwangju 구간 사설망 연결

   # ISP-2
router eigrp 100
 no auto-summary
 network 13.13.20.0  0.0.0.255
 network 211.241.25.0
 passive-interface default
 no passive-interface fastethernet 0/0
!


   # Gwangju (R5)
router eigrp 100
 no auto-summary
 network 13.13.5.0  0.0.0.255
 network 192.168.5.0
 network 211.241.25.0
 passive-interface default
 no passive-interface fastethernet 0/0
!

          정보 확인

ISP-2# show ip eigrp neighbor
IP-EIGRP neighbors for process 100
H   Address                 	Interface       Hold  Uptime   SRTT   RTO  Q   Seq
                                                        (sec)               (ms)          Cnt Num
0   211.241.25.5            	Fa0/0              12  00:00:05   58    348   0   3


ISP-2# show ip route eigrp
D    192.168.5.0/24 [90/307200] via 211.241.25.5, 00:00:04, FastEthernet0/0        <---- 광주 지사 경로 확인
      13.0.0.0/24 is subnetted, 8 subnets
D       13.13.5.0 [90/409600] via 211.241.25.5, 00:00:04, FastEthernet0/0

ISP-2# ping 192.168.5.5








            ## ISP-2  <--->  Busan 구간 사설망 연결

   # ISP-3
router eigrp 100
 no auto-summary
 network 13.13.30.0  0.0.0.255
 network 211.241.36.0
 passive-interface default
 no passive-interface fastethernet 0/0
!


   # Busan (R6)
router eigrp 100
 no auto-summary
 network 13.13.6.0  0.0.0.255
 network 192.168.6.0
 network 211.241.36.0
 passive-interface default
 no passive-interface fastethernet 0/0
!

          정보 확인

ISP-3# show ip eigrp neighbor
IP-EIGRP neighbors for process 100
H   Address                 	Interface       Hold  Uptime   SRTT   RTO  Q   Seq
                                                        (sec)               (ms)          Cnt Num
0   211.241.36.6            	Fa0/0              12  00:00:05   58    348   0   3


ISP-3# show ip route eigrp
D    192.168.6.0/24 [90/307200] via 211.241.36.6, 00:00:05, FastEthernet0/0        <---- 부산 지사 경로 확인
      13.0.0.0/24 is subnetted, 8 subnets
D       13.13.6.0 [90/409600] via 211.241.36.6, 00:00:05, FastEthernet0/0

ISP-3# ping 192.168.6.6








=============================================================================================================================


         # 사설망간 연결을 위해서 Tunnel 연결

-MGRE  (Muti-GER)
 .GRE Tunnel은 Default Network Type이 Point-to-point로 구성된다.
 .MGRE란 하나의 Tunnel을 사용하여 다수의 Router간 Tunnel을 연결하는 기능을 의미한다.

-NHRP (Next-Hop Resolution Protocol)
 : Tunnel은 Default Network Type이 Point-to-point이므로 다수의 Router를 하나의 Tunnel로 연결할수 없다.
   MGRE구성시 NHRP를 사용하여 다수의 router간 Next-hop을 연결해야한다.
   (NHRP Server & NHRP Client로 구성된다.)




EX) ISP-1 , ISP-2 , ISP-3구간을 연결하는 Tunnel을 구성하시오
 .ISP-1 , ISP2 , ISP-3구간에서 tunnel을 사용하여 사설망을 연결해야한다. [단 Tunnel은 1개이상 구성할수 없다.]
 .Tunnel IP 주소는 172.16.123.0/24로 구성하며 Tunnel 구성시 Source IP 주소는 Loopback 0의 IP 주소를 사용해야한다.
 .GRE Tunnel 구성시동일한 Key값을 갖은 구간만 연결되어야한다.  [Key = 20150529]
 .NHRP를 사용하여 Next-hop 지정시 인증을 사용하여 연결해야한다. [Password = DMVPN]
 .서울 본사가 연결된 ISP-1이 NHRP Server로 동작하며 ISP-2 , ISP-3은 NHRP Client로 동작해야한다.


     # ISP-1   [NHRP Server]
interface tunnel 123
 ip address 172.16.123.1  255.255.255.0
 tunnel source 13.13.1.1
 tunnel mode gre multipoint
 tunnel key 20150529
 ip nhrp network-id 123
 ip nhrp authentication DMVPN
 ip nhrp map multicast dynamic
!


     # ISP-2   [NHRP Client]
interface tunnel 123
 ip address 172.16.123.2  255.255.255.0
 tunnel source 13.13.2.2
 tunnel mode gre multipoint
 tunnel key 20150529
 ip nhrp network-id 123
 ip nhrp authentication DMVPN
 ip nhrp nhs 172.16.123.1
 ip nhrp map 172.16.123.1 13.13.1.1
 ip nhrp map multicast 13.13.1.1
!


     # ISP-3   [NHRP Client]
interface tunnel 123
 ip address 172.16.123.3  255.255.255.0
 tunnel source 13.13.3.3
 tunnel mode gre multipoint
 tunnel key 20150529
 ip nhrp network-id 123
 ip nhrp authentication DMVPN
 ip nhrp nhs 172.16.123.1
 ip nhrp map 172.16.123.1 13.13.1.1
 ip nhrp map multicast 13.13.1.1
!

             정보 확인

ISP-1# show ip nhrp dynamic    [NHRP Server]
172.16.123.2/32 via 172.16.123.2, Tunnel123 created 00:00:42, expire 01:59:17
  Type: dynamic, Flags: unique nat registered 
  NBMA address: 13.13.2.2 
172.16.123.3/32 via 172.16.123.3, Tunnel123 created 00:00:37, expire 01:59:22
  Type: dynamic, Flags: unique nat registered 
  NBMA address: 13.13.3.3 


ISP-1# show ip nhrp brief    [NHRP Server]
   Target             	       Via            NBMA           Mode    Intfc   	 Claimed 
172.16.123.2/32    172.16.123.2    13.13.2.2       dynamic  Tu123	 <   >
172.16.123.3/32    172.16.123.3    13.13.3.3       dynamic  Tu123	 <   >



ISP-2# show ip nhrp static    [NHRP Client]
172.16.123.1/32 via 172.16.123.1, Tunnel123 created 00:01:47, never expire 
  Type: static, Flags: nat used 
  NBMA address: 13.13.1.1 


ISP-3# show ip nhrp static    [NHRP Client]
172.16.123.1/32 via 172.16.123.1, Tunnel123 created 00:01:48, never expire 
  Type: static, Flags: nat used 
  NBMA address: 13.13.1.1 


ISP-1# show ip route
C    211.241.14.0/24 is directly connected, FastEthernet0/0
      172.16.0.0/24 is subnetted, 1 subnets
C       172.16.123.0 is directly connected, Tunnel123
D    192.168.4.0/24 [90/307200] via 211.241.14.4, 00:21:09, FastEthernet0/0
      13.0.0.0/24 is subnetted, 8 subnets
C       13.13.1.0 is directly connected, Loopback0
O       13.13.2.0 [110/65] via 13.13.12.2, 00:45:15, Serial1/0.12
O       13.13.3.0 [110/65] via 13.13.13.3, 00:45:15, Serial1/0.13
D       13.13.4.0 [90/409600] via 211.241.14.4, 00:21:09, FastEthernet0/0
C       13.13.10.0 is directly connected, FastEthernet0/1
C       13.13.12.0 is directly connected, Serial1/0.12
C       13.13.13.0 is directly connected, Serial1/0.13
O       13.13.23.0 [110/128] via 13.13.13.3, 00:45:15, Serial1/0.13
                        [110/128] via 13.13.12.2, 00:45:15, Serial1/0.12
ISP-1# ping 172.16.123.2
ISP-1# ping 172.16.123.3



ISP-2# show ip route
ISP-2# ping 172.16.123.1
ISP-2# ping 172.16.123.3


ISP-3# show ip route
ISP-3# ping 172.16.123.1
ISP-3# ping 172.16.123.2



=============================================================================================================================

                      ## 각 사설망을 연결하기위해서 Tunnel을 EIGRP에 포함

   # ISP-1
router eigrp 100
 network 172.16.123.0  0.0.0.255
 no passive-interface tunnel 123
!
interface tunnel 123
 no ip split-horizon eigrp 100
!

   # ISP-2
router eigrp 100
 network 172.16.123.0  0.0.0.255
 no passive-interface tunnel 123
!


   # ISP-3
router eigrp 100
 network 172.16.123.0  0.0.0.255
 no passive-interface tunnel 123
!

        정보 확인

Seoul-HQ# show ip route
C     211.241.14.0/24 is directly connected, FastEthernet0/0
D     211.241.25.0/24 [90/297295616] via 211.241.14.1, 00:00:18, FastEthernet0/0
      172.16.0.0/24 is subnetted, 1 subnets
D       172.16.123.0 [90/297270016] via 211.241.14.1, 00:00:19, FastEthernet0/0
D     211.241.36.0/24 
           [90/297295616] via 211.241.14.1, 00:00:17, FastEthernet0/0
C    192.168.4.0/24 is directly connected, FastEthernet0/1			<--- 서울 본사 네트워크
D    192.168.5.0/24 [90/297321216] via 211.241.14.1, 00:00:18, FastEthernet0/0	<--- 광주 지사 네트워크
D    192.168.6.0/24 [90/297321216] via 211.241.14.1, 00:00:17, FastEthernet0/0	<--- 부산 지사 네트워크
      13.0.0.0/24 is subnetted, 6 subnets
C       13.13.4.0 is directly connected, Loopback0
D       13.13.5.0 [90/297423616] via 211.241.14.1, 00:00:18, FastEthernet0/0
D       13.13.6.0 [90/297423616] via 211.241.14.1, 00:00:17, FastEthernet0/0
D       13.13.10.0 [90/307200] via 211.241.14.1, 00:18:45, FastEthernet0/0
D       13.13.20.0 [90/297295616] via 211.241.14.1, 00:00:18, FastEthernet0/0
D       13.13.30.0 [90/297295616] via 211.241.14.1, 00:00:17, FastEthernet0/0


Gwangju# show ip route
D    211.241.14.0/24 [90/297295616] via 211.241.25.2, 00:01:26, FastEthernet0/0
C    211.241.25.0/24 is directly connected, FastEthernet0/0
     172.16.0.0/24 is subnetted, 1 subnets
D       172.16.123.0 [90/297270016] via 211.241.25.2, 00:01:26, FastEthernet0/0
D    211.241.36.0/24 
           [90/310095616] via 211.241.25.2, 00:00:25, FastEthernet0/0
D    192.168.4.0/24 [90/297321216] via 211.241.25.2, 00:01:26, FastEthernet0/0	<--- 서울 본사 네트워크
C    192.168.5.0/24 is directly connected, FastEthernet0/1			<--- 광주 지사 네트워크
D    192.168.6.0/24 [90/310121216] via 211.241.25.2, 00:00:25, FastEthernet0/0	<--- 부산 지사 네트워크
     13.0.0.0/24 is subnetted, 6 subnets
D       13.13.4.0 [90/297423616] via 211.241.25.2, 00:01:26, FastEthernet0/0
C       13.13.5.0 is directly connected, Loopback0
D       13.13.6.0 [90/310223616] via 211.241.25.2, 00:00:26, FastEthernet0/0
D       13.13.10.0 [90/297295616] via 211.241.25.2, 00:01:26, FastEthernet0/0
D       13.13.20.0 [90/307200] via 211.241.25.2, 00:04:07, FastEthernet0/0
D       13.13.30.0 [90/310095616] via 211.241.25.2, 00:00:26, FastEthernet0/0


Busan# show ip route
D    211.241.14.0/24 [90/297295616] via 211.241.36.3, 00:01:53, FastEthernet0/0
D    211.241.25.0/24 [90/310095616] via 211.241.36.3, 00:00:53, FastEthernet0/0
     172.16.0.0/24 is subnetted, 1 subnets
D       172.16.123.0 [90/297270016] via 211.241.36.3, 00:01:53, FastEthernet0/0
C    211.241.36.0/24 is directly connected, FastEthernet0/0
D    192.168.4.0/24 [90/297321216] via 211.241.36.3, 00:01:53, FastEthernet0/0	<--- 서울 본사 네트워크
D    192.168.5.0/24 [90/310121216] via 211.241.36.3, 00:00:53, FastEthernet0/0	<--- 광주 지사 네트워크
C    192.168.6.0/24 is directly connected, FastEthernet0/1			<--- 부산 지사 네트워크
     13.0.0.0/24 is subnetted, 6 subnets
D       13.13.4.0 [90/297423616] via 211.241.36.3, 00:01:53, FastEthernet0/0
D       13.13.5.0 [90/310223616] via 211.241.36.3, 00:00:53, FastEthernet0/0
C       13.13.6.0 is directly connected, Loopback0
D       13.13.10.0 [90/297295616] via 211.241.36.3, 00:01:53, FastEthernet0/0
D       13.13.20.0 [90/310095616] via 211.241.36.3, 00:00:53, FastEthernet0/0
D       13.13.30.0 [90/307200] via 211.241.36.3, 00:19:31, FastEthernet0/0




=============================================================================================================================

                      ## MGRE-Over-IPsec (DMVPN) 구성

EX1) 아래의 조건에맞게 설정을 실시하시오
 .Seoul-HQ , Gwangju , Busan구간에서  MGRE-Over-IPsec 서비스를 구성하시오
 .Tunnel을 사용하여 통신하는 Routing Protocol을 포함한 모든 데이터는 IPsec을 사용하여 정보를 보호해야 한다.
 .VPN 타입은 Site-to-stie IPsec VPN이며 ISP-1 , ISP-2 , ISP-3 구간에서 서비스를 실시

-Phase-1
 .IKE 보안정책
 .Authentication 	: Pre-share
 .암호화 		: DES
 .HASH 		: MD5
 .Diffie-Hellman 	: 2
 .Key교환주기 	: 3600 sec

-Phase-2
 .IPsec 보안 정책은 ESP-AES로 암호화하며 ESP-SHA-HMAC로 인증 실시

     # ISP-1
crypto isakmp enable
!
crypto isakmp policy 10
 authentication pre-share
 encryption des
 hash md5
 group 2
 lifetime 3600
!
crypto isakmp key 0 cisco address 0.0.0.0  0.0.0.0	: 다수의 VPN 장비를 연결하기위한설정 (NHRP Server에서 설정)
!
crypto ipsec transform-set VPN esp-aes esp-sha-hmac
!
crypto ipsec profile DMVPN		: 다수의 VPN 장비와 연결시 Crypto map형식이 아닌 Profile형식으로 적용
 set transform-set VPN
!
interface tunnel 123
 tunnel protection ipsec profile DMVPN
!


     # ISP-2 , ISP-3
crypto isakmp enable
!
crypto isakmp policy 10
 authentication pre-share
 encryption des
 hash md5
 group 2
 lifetime 3600
!
crypto isakmp key 0 cisco address 13.13.1.1	: NHRP Server의 IP 설정
!
crypto ipsec transform-set VPN esp-aes esp-sha-hmac
!
crypto ipsec profile DMVPN
 set transform-set VPN
!
interface tunnel 123
 tunnel protection ipsec profile DMVPN
!

           정보 확인

ISP-1# show crypto isakmp peer   [Phase-1  연결 확인]
Peer: 13.13.2.2 Port: 500 Local: 13.13.1.1	: 광주 지사 연결 확인
 Phase1 id: 13.13.2.2
Peer: 13.13.3.3 Port: 500 Local: 13.13.1.1	: 부산 지사 연결 확인
 Phase1 id: 13.13.3.3


ISP-2# show crypto isakmp peer   [Phase-1  연결 확인]
Peer: 13.13.1.1 Port: 500 Local: 13.13.2.2	: 서울 본사 연결 확인
 Phase1 id: 13.13.1.1


ISP-3# show crypto isakmp peer   [Phase-1  연결 확인]
Peer: 13.13.1.1 Port: 500 Local: 13.13.3.3	: 서울 본사 연결 확인
 Phase1 id: 13.13.1.1



ISP-1# show crypto engine connections active 
Crypto Engine Connections
     ID Interface   Type  Algorithm           Encrypt  Decrypt  IP-Address
      1 Se1/0.12   IPsec AES+SHA                   	0       	7  13.13.1.1
      2 Se1/0.12   IPsec AES+SHA                  	7        	0  13.13.1.1
      3 Se1/0.13   IPsec AES+SHA                   	0       	7  13.13.1.1
      4 Se1/0.13   IPsec AES+SHA                  	7        	0  13.13.1.1
 1001 Se1/0.12   IKE   MD5+DES                   	0        	0  13.13.1.1
 1002 Se1/0.13   IKE   MD5+DES                   	0        	0  13.13.1.1


ISP-2# show crypto engine connections active 
Crypto Engine Connections
     ID Interface   Type  Algorithm           Encrypt  Decrypt  IP-Address
      1 Tu123      IPsec AES+SHA                   	0      	8  13.13.2.2
      2 Tu123      IPsec AES+SHA                 	8        	0  13.13.2.2
 1001 Tu123      IKE   MD5+DES                   	0        	0  13.13.2.2


ISP-3# show crypto engine connections active 
Crypto Engine Connections
     ID Interface   Type  Algorithm           Encrypt  Decrypt  IP-Address
      1 Tu123      IPsec AES+SHA                  	0      	9  13.13.3.3
      2 Tu123      IPsec AES+SHA                  	9        	0  13.13.3.3
 1001 Tu123      IKE   MD5+DES                   	0        	0  13.13.3.3































































