                                     ### NAT (Network Address Translation : 326 Page)

-IP 주소의 낭비를 막기위해서 내부망에의 사설 IP 주소를 공인 IP 주소로 변환하는 기능

-ISP와 같은 공중망은 공인 IP 주소를 사용하여 네트워크를 구성하며
  사설망은 사설 IP 주소를 사용하여 네트워크를 구성한다.

-ISP에서는 출발지 IP 주소가 사설 대역인 모든 트래픽을 방화벽에서 차단한다.

-NAT기능에 의해서 사설 IP 주소가 외부 네트워크 구간으로 통신시 공인 IP 주소로 변환되어 통신한다.

-사설 주소
 .A Class : 10.0.0.0 ~ 10.255.255.255	  (10.X.X.X)
 .B Class : 172.16.0.0 ~ 172.31.255.255
 .C Class : 192.168.0.0 ~ 192.168.255.255  (192.168.X.X)

-NAT의 기능
 .외부 네트워크에서는 내부의 사설 IP 주소를 확인할수 없다.  (방화벽 기능)
 .외부의 다른 네트워크에서도 자신과 동일한 사설 IP 주소를 사용할수 있다. (Overlapping)
 .다수의 사설 IP 주소가 하나의 공인 IP 주소를 사용하여 통신이 실시 (Overloading)

-NAT는 사설 IP 주소와 공인 IP 주소가 1:1로 변환되는 Static NAT와
 사설 IP 주소와 공인 IP 주소가 다수:소수 , N:1로 변환되는 Dynamic NAT로 구성이 가능하다.
 (일반적으로 사용되는 NAT는 Dynamic NAT를 의미한다.)



==================================================================================================================


                       # Static NAT

-사설 IP 주소와 공인 IP 주소가 1:1로 고정 변환되는 기능이다.

-Static NAT구성시 외부망에서 공인 IP 주소를 목적지로 하여 통신하게되면
  Static NAT에 의해 사설 IP 주소로 변경되므로 내부 네트워크로 접속이 가능하다. (역변환 기능 가능)

                [설정 방법]

                         121.160.70.0/24                                     192.168.10.0/24
                S1/0                                    S1/1      Fa0/1                                 Fa0/1    
           R1--------------------------------R2--------------------------------R3
            |                                            70.2      10.254                                 10.3
      Loop 211
   211.241.228.18/24


EX1) R2는 출발지 주소가 192.168.10.3인 주소가 외부 네트워크로 통신시
       공인주소 121.160.70.2(Serial 1/1)로 변환되어져야 한다.

   # R2
ip nat inside source static 192.168.10.3 121.160.70.2
!
interface fastethernet 0/1
 ip nat inside
!
interface serial 1/1
 ip nat outside
!

   ---- OR ----

   # R2
ip nat inside source static 192.168.10.3 interface serial 1/1
!
interface fastethernet 0/1
 ip nat inside
!
interface serial 1/1
 ip nat outside
!


                정보확인

R2#show ip nat translations 
Pro   Inside global      Inside local        Outside local        Outside global
---   121.160.70.2      192.168.10.3       ---                    ---

R2# debug ip nat             
IP NAT debugging is on
*Mar  1 00:17:02.095: NAT*: s=192.168.10.3->121.160.70.2, d=211.241.228.18 [5]
*Mar  1 00:17:02.119: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.3 [5]

*Mar  1 00:17:02.159: NAT*: s=192.168.10.3->121.160.70.2, d=211.241.228.18 [6]
*Mar  1 00:17:02.187: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.3 [6]

*Mar  1 00:17:02.227: NAT*: s=192.168.10.3->121.160.70.2, d=211.241.228.18 [7]
*Mar  1 00:17:02.255: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.3 [7]

*Mar  1 00:17:02.303: NAT*: s=192.168.10.3->121.160.70.2, d=211.241.228.18 [8]
*Mar  1 00:17:02.335: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.3 [8]

*Mar  1 00:17:02.371: NAT*: s=192.168.10.3->121.160.70.2, d=211.241.228.18 [9]
*Mar  1 00:17:02.403: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.3 [9]










                   ## 역변환 기능 확인

R2# debug ip nat
IP NAT debugging is ont


R3# debug ip icmp
ICMP packet debugging is on


R1# ping 121.160.70.2 source 211.241.228.18
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 121.160.70.2, timeout is 2 seconds:
Packet sent with a source address of 211.241.228.18 
!!!!!

                       ###### R2에서 Debug 정보 확인 ######

*Mar  1 00:30:29.343: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.3 [10]
*Mar  1 00:30:29.363: NAT*: s=192.168.10.3->121.160.70.2, d=211.241.228.18 [10]

*Mar  1 00:30:29.403: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.3 [11]
*Mar  1 00:30:29.431: NAT*: s=192.168.10.3->121.160.70.2, d=211.241.228.18 [11]

*Mar  1 00:30:29.471: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.3 [12]
*Mar  1 00:30:29.499: NAT*: s=192.168.10.3->121.160.70.2, d=211.241.228.18 [12]

*Mar  1 00:30:29.531: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.3 [13]
*Mar  1 00:30:29.559: NAT*: s=192.168.10.3->121.160.70.2, d=211.241.228.18 [13]

*Mar  1 00:30:29.595: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.3 [14]
*Mar  1 00:30:29.627: NAT*: s=192.168.10.3->121.160.70.2, d=211.241.228.18 [14]


                       ###### R3에서 Debug 정보 확인 ######
*Mar  1 00:31:48.643: ICMP: echo reply sent, src 192.168.10.3, dst 211.241.228.18
*Mar  1 00:31:48.679: ICMP: echo reply sent, src 192.168.10.3, dst 211.241.228.18
*Mar  1 00:31:48.723: ICMP: echo reply sent, src 192.168.10.3, dst 211.241.228.18
*Mar  1 00:31:48.787: ICMP: echo reply sent, src 192.168.10.3, dst 211.241.228.18
*Mar  1 00:31:48.835: ICMP: echo reply sent, src 192.168.10.3, dst 211.241.228.18






       # R2 , R3
line vty 0 4
 password ciscotel
 login
!


R1# telnet 121.160.70.2  /source-interface loopback 211
Trying 121.160.70.2 ... Open
User Access Verification
Password: 
R3>          <----- R3으로 Telnet 접속 확인

-R1에서 R2의 Serial 1/1의 IP주소인 121.160.70.2로 Telnet 접속을 실시하게되면
  NAT 기능에 의해서 192.168.10.3으로 주소 변환이 실시되므로 R3으로 접속된다.



R3# show tcp brief
TCB       	   Local Address               	Foreign Address             	(state)
666D5FD8   192.168.10.3.23             	211.241.228.18.16121        	ESTAB












               ## Dynamic NAT실습을위해서 Static NAT 설정 삭제


   # R2
R2# clear ip nat translation *
R2#conf t
!
R2(config)# no ip nat inside source static 192.168.10.3 121.160.70.2
!
R2(config)# interface fastethernet 0/1
R2(config-if)# no ip nat inside
!
R2(config)# interface serial 1/1
R2(config-if)# no ip nat outside

-NAT Table에 변환된 주소 정보가 존재하게되면 NAT설정은 삭제되지 않는다.
  ['clear ip nat translation *' command를 사용하여 NAT table삭제후 NAT 설정을 삭제할수 있다.]






















==================================================================================================================

                       # Dynamic NAT

-Dynamic NAT는 다수의 사설 IP 주소가 소수의 공인 IP 주소로 변환되어 통신하는 기능으로
  내부에서 외부로 통신시 Port번호를 사용하여 사설 IP 주소가 공인 IP 주소로변환이 이루어지며
  외부에서 생성되어 입력되는 트래픽에 대해서는 Port 번호가 존재하지 않기때문에 IP 주소변환되지 않는다.
   (Static NAT와 달리 역변환 기능은 지원되지 않기때문에 외부에서 내부로 통신은 불가능하다.)


     # R3
interface fastethernet 0/1
 ip address 192.168.10.1  255.255.255.0		: PC1 IP 주소 할당
 ip address 192.168.10.2  255.255.255.0 secondary	: PC2 IP 주소 할당
 ip address 192.168.10.3  255.255.255.0 secondary	: PC3 IP 주소 할당
!


R3# ping 192.168.10.254  source 192.168.10.1    : G/W  <---- PC1
R3# ping 192.168.10.254  source 192.168.10.2    : G/W  <---- PC2
R3# ping 192.168.10.254  source 192.168.10.3    : G/W  <---- PC3



                         121.160.70.0/24                                    192.168.10.0/24
                S1/0                                    S1/1      Fa0/1                                 Fa0/1    
           R1--------------------------------R2--------------------------------R3
            |                                            70.2      10.254                                 10.3
      Loop 211
   211.241.228.18/24


EX1) R2는 192.168.10.0/24 네트워크가 외부 네트워크로 통신시
        Serial 1/1 (121.160.70.2)로 변경되어 통신이 실시 되어져야 한다.

1.ACL을 사용하여 사설 주소의 범위를 지정
2.NAT Pool을 사용하여 공인주소의 범위를 지정
3.NAT를 사용하여 사설주소를 공인주소로 대입
4.Interface에 적용

    # R2
access-list 1 permit 192.168.10.0  0.0.0.255
!
ip nat pool CCNA 121.160.70.2  121.160.70.2  netmask 255.255.255.0
!
ip nat inside source list 1  pool CCNA  overload
!
interface fastethernet 0/1
 ip nat inside
!
interface serial 1/1
 ip nat outside
!

           정보 확인

R3# ping 211.241.228.18  source 192.168.10.1
R3# ping 211.241.228.18  source 192.168.10.2
R3# ping 211.241.228.18  source 192.168.10.3

R2# show ip nat translation
Pro Inside global           Inside local           Outside local           Outside global
icmp 121.160.70.2:11    192.168.10.1:11    211.241.228.18:11    211.241.228.18:11
icmp 121.160.70.2:12    192.168.10.2:12    211.241.228.18:12    211.241.228.18:12
icmp 121.160.70.2:13    192.168.10.3:13    211.241.228.18:13    211.241.228.18:13








R2# debug ip nat
IP NAT debugging is on

R3# ping 211.241.228.18  source 192.168.10.1
R3# ping 211.241.228.18  source 192.168.10.2
R3# ping 211.241.228.18  source 192.168.10.3


                       ###### R2에서 Debug 정보 확인 ######

                         ## 211.241.228.18  <----  192.168.10.1
*Mar  1 00:44:59.779: NAT*: s=192.168.10.1->121.160.70.2, d=211.241.228.18 [70]
*Mar  1 00:44:59.807: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.1 [70]


                         ## 211.241.228.18  <----  192.168.10.2
*Mar  1 00:45:02.803: NAT*: s=192.168.10.2->121.160.70.2, d=211.241.228.18 [75]
*Mar  1 00:45:02.839: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.2 [75]


                         ## 211.241.228.18  <----  192.168.10.3
*Mar  1 00:45:06.443: NAT*: s=192.168.10.3->121.160.70.2, d=211.241.228.18 [80]
*Mar  1 00:45:06.475: NAT*: s=211.241.228.18, d=121.160.70.2->192.168.10.3 [80]




R1# telnet 121.160.70.2  /source-interface loopback 211
Trying 121.160.70.2 ... Open
User Access Verification
Password: 
R2>          <----- R2로 Telnet 접속 확인

-R1에서 R2의 Serial 1/1의 IP주소인 121.160.70.2로 Telnet 접속을 실시하게되면
  외부에서 생성된 트래픽에 대해서는 Port 번호가 없기때문에 주소변환이 되지 않는다.
  즉 역변환 기능이 되지 않기때문에 R2로 Telnet접속이 실시된다.



























